Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1100_Q24/RTE_Device.h
// <o>IRQ Priority <0-3>
// <i> Defines priority of SPI events IRQ handling
// <i> Default: 3
#define RTE_SPI0_IRQ_PRIORITY  3

//</e>

// <e> SPI1 (Serial peripheral interface) [Driver_SPI1]
// <i> Configuration settings for Driver_SPI1 in component ::Drivers:SPI
#define RTE_SPI1                      0

//   <o> SPI1 TX MOSI(master) MISO(slave) <0=>P0_6 <1=>P0_7 <2=>P1_2 <3=>P1_3 <5=>P2_10 <6=>P2_11   
#define RTE_SPI1_TX_ID                0

#if    (RTE_SPI1_TX_ID == 0)
#define RTE_SPI1_TX_PORT              P0_6
#define RTE_SPI1_TX_AF                P0_6_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 1)
#define RTE_SPI1_TX_PORT              P0_7
#define RTE_SPI1_TX_AF                P0_7_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 2)
#define RTE_SPI1_TX_PORT              P1_2
#define RTE_SPI1_TX_AF                P1_2_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 3)
#define RTE_SPI1_TX_PORT              P1_3
#define RTE_SPI1_TX_AF                P1_3_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 5)
#define RTE_SPI1_TX_PORT              P2_10
#define RTE_SPI1_TX_AF                P2_10_AF_U0C1_DOUT0
#elif  (RTE_SPI1_TX_ID == 6)
#define RTE_SPI1_TX_PORT              P2_11
#define RTE_SPI1_TX_AF                P2_11_AF_U0C1_DOUT0
#else
#error "Invalid SPI1_TX Pin Configuration!"
#endif

//   <o> SPI1 RX MISO(master) MOSI(slave) Pin <0=>P0_6 <1=>P0_7 <2=>P1_2 <3=>P1_3 <4=>P2_10 <5=>P2_11
#define RTE_SPI1_RX_ID                0

#if    (RTE_SPI1_RX_ID == 0)
#define RTE_SPI1_RX_PORT              P0_6
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P0_6
#elif  (RTE_SPI1_RX_ID == 1)
#define RTE_SPI1_RX_PORT              P0_7
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P0_7
#elif  (RTE_SPI1_RX_ID == 2)
#define RTE_SPI1_RX_PORT              P1_2
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P1_2
#elif  (RTE_SPI1_RX_ID == 3)
#define RTE_SPI1_RX_PORT              P1_3
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P1_3
#elif  (RTE_SPI1_RX_ID == 4)
#define RTE_SPI1_RX_PORT              P2_10
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P2_10
#elif  (RTE_SPI1_RX_ID == 5)
#define RTE_SPI1_RX_PORT              P2_11
#define RTE_SPI1_RX_INPUT             USIC0_C1_DX0_P2_11
#else
#error "Invalid SPI1_RX Pin Configuration!"
#endif

//   <o> SPI1_CLK OUTPUT Pin <0=>P0_8 <1=>P1_3 <3=>P2_1 <4=>P2_11
#define RTE_SPI1_CLK_OUTPUT_ID                0

#if    (RTE_SPI1_CLK_OUTPUT_ID == 0)
#define RTE_SPI1_CLK_OUTPUT_PORT              P0_8
#define RTE_SPI1_CLK_AF                       P0_8_AF_U0C1_SCLKOUT
#elif  (RTE_SPI1_CLK_OUTPUT_ID == 1)
#define RTE_SPI1_CLK_OUTPUT_PORT              P1_3
#define RTE_SPI1_CLK_AF                       P1_3_AF_U0C1_SCLKOUT
#elif  (RTE_SPI1_CLK_OUTPUT_ID == 3)
#define RTE_SPI1_CLK_OUTPUT_PORT              P2_1
#define RTE_SPI1_CLK_AF                       P2_1_AF_U0C1_SCLKOUT
#elif  (RTE_SPI1_CLK_OUTPUT_ID == 4)
#define RTE_SPI1_CLK_OUTPUT_PORT              P2_11
#define RTE_SPI1_CLK_AF                       P2_11_AF_U0C1_SCLKOUT
#else
#error "Invalid SPI1 CLOCK OUTPUT Pin Configuration!"
#endif

// <h> SPI1_SLAVE SELECT Pins
// <e> SLAVE SELECT LINE 0
// <i> Enable slave select line 0
#define RTE_SPI1_SLAVE_SELECT_LINE0 0

//   <o> SPI1_SLAVE SELECT LINE 0 Pin <0=>P0_0 <1=>P0_9 <2=>P1_1
#define RTE_SPI1_SLAVE_SELECT_LINE_0_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_LINE_0_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_LINE_0_PORT              P0_0
#define RTE_SPI1_SLAVE_SELECT_LINE_0_AF                P0_0_AF_U0C1_SELO0
#elif  (RTE_SPI1_SLAVE_SELECT_LINE_0_ID == 1)
#define RTE_SPI1_SLAVE_SELECT_LINE_0_PORT              P0_9
#define RTE_SPI1_SLAVE_SELECT_LINE_0_AF                P0_9_AF_U0C1_SELO0
#elif  (RTE_SPI1_SLAVE_SELECT_LINE_0_ID == 2)
#define RTE_SPI1_SLAVE_SELECT_LINE_0_PORT              P1_1
#define RTE_SPI1_SLAVE_SELECT_LINE_0_AF                P1_1_AF_U0C1_SELO0
#else
#error "Invalid SPI1 SLAVE SELECT LINE 0 Pin Configuration!"
#endif
// </e>

#define RTE_SPI1_SLAVE_SELECT_LINE1 0

#define RTE_SPI1_SLAVE_SELECT_LINE2 0

#define RTE_SPI1_SLAVE_SELECT_LINE3 0
// </h>

//   <o> SPI1_CLK INPUT Pin <0=>P1_3 <1=>P0_8 <2=>P0_7 <3=>P2_11
#define RTE_SPI1_CLK_INPUT_ID                0

#if    (RTE_SPI1_CLK_INPUT_ID == 0)
#define RTE_SPI1_CLK_INPUT_PORT              P1_3
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P1_3
#elif  (RTE_SPI1_CLK_INPUT_ID == 1)
#define RTE_SPI1_CLK_INPUT_PORT              P0_8
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P0_8
#elif  (RTE_SPI1_CLK_INPUT_ID == 2)
#define RTE_SPI1_CLK_INPUT_PORT              P0_7
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P0_7
#elif  (RTE_SPI1_CLK_INPUT_ID == 3)
#define RTE_SPI1_CLK_INPUT_PORT              P2_11
#define RTE_SPI1_CLK_INPUT                   USIC0_C1_DX1_P2_11
#else
#error "Invalid SPI1 CLOCK INPUT Pin Configuration!"
#endif

//   <o> RTE_SPI1_SLAVE_SELECT INPUT Pin <0=>P0_0 <1=>P0_9 <4=>P1_1 <5=>P2_0
#define RTE_SPI1_SLAVE_SELECT_INPUT_ID                0

#if    (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 0)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_0
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_0
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 1)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P0_9
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P0_9
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 4)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P1_1
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P1_1
#elif  (RTE_SPI1_SLAVE_SELECT_INPUT_ID == 5)
#define RTE_SPI1_SLAVE_SELECT_INPUT_PORT              P2_0
#define RTE_SPI1_SLAVE_SELECT_INPUT                   USIC0_C1_DX2_P2_0
#else
#error "Invalid SPI1 SLAVE SELECT INPUT Pin Configuration!"
#endif

//   <o> SPI1_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_SPI1_RX_FIFO_SIZE_ID                4

#if    (RTE_SPI1_RX_FIFO_SIZE_ID == 0)
#define RTE_SPI1_RX_FIFO_SIZE         NO_FIFO
#define RTE_SPI1_RX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 1)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI1_RX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 2)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI1_RX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 3)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI1_RX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 4)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI1_RX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI1_RX_FIFO_SIZE_ID == 5)
#define RTE_SPI1_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI1_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI1_RX FIFO SIZE Configuration!"
#endif

//   <o> SPI1_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
#define RTE_SPI1_TX_FIFO_SIZE_ID                4

#if    (RTE_SPI1_TX_FIFO_SIZE_ID == 0)
#define RTE_SPI1_TX_FIFO_SIZE         NO_FIFO
#define RTE_SPI1_TX_FIFO_SIZE_NUM     0
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 1)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_SPI1_TX_FIFO_SIZE_NUM     2
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 2)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_SPI1_TX_FIFO_SIZE_NUM     4
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 3)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_SPI1_TX_FIFO_SIZE_NUM     8
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 4)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_SPI1_TX_FIFO_SIZE_NUM     16
#elif  (RTE_SPI1_TX_FIFO_SIZE_ID == 5)
#define RTE_SPI1_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_SPI1_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid SPI1_TX FIFO SIZE Configuration!"
#endif

