Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1100_Q24/RTE_Device.h
//</e>

#define RTE_I2C2                      0
#define RTE_I2C3                      0
#define RTE_I2C4                      0
#define RTE_I2C5                      0

// <e> I2S0 (Inter-Integrated Sound) [Driver_SAI0]
// <i> Configuration settings for Driver_SAI0 in component ::Drivers:SAI
#define RTE_I2S0                      0

//   <o> I2S0_TX Pin <0=>P0_14 <1=>P0_15 <2=>P1_0 <3=>P1_1 <5=>P2_0 <6=>P2_1
//   <i> Transmit data for I2S0
#define RTE_I2S0_TX_ID                0

#if    (RTE_I2S0_TX_ID == 0)
#define RTE_I2S0_TX_PORT              P0_14
#define RTE_I2S0_TX_AF                P0_14_AF_U0C0_DOUT0
#elif  (RTE_I2S0_TX_ID == 1)
#define RTE_I2S0_TX_PORT              P0_15
#define RTE_I2S0_TX_AF                P0_15_AF_U0C0_DOUT0
#elif  (RTE_I2S0_TX_ID == 2)
#define RTE_I2S0_TX_PORT              P1_0
#define RTE_I2S0_TX_AF                P1_0_AF_U0C0_DOUT0
#elif  (RTE_I2S0_TX_ID == 3)
#define RTE_I2S0_TX_PORT              P1_1
#define RTE_I2S0_TX_AF                P1_1_AF_U0C0_DOUT0
#elif  (RTE_I2S0_TX_ID == 5)
#define RTE_I2S0_TX_PORT              P2_0
#define RTE_I2S0_TX_AF                P2_0_AF_U0C0_DOUT0
#elif  (RTE_I2S0_TX_ID == 6)
#define RTE_I2S0_TX_PORT              P2_1
#define RTE_I2S0_TX_AF                P2_1_AF_U0C0_DOUT0
#else
#error "Invalid I2S0_TX Pin Configuration!"
#endif

//   <o> I2S0_RX Pin <0=>P0_14 <1=>P0_15 <2=>P1_0 <3=>P1_1 <4=>P2_0 <5=>P2_1
//   <i> Receive data for I2S0
#define RTE_I2S0_RX_ID                0

#if    (RTE_I2S0_RX_ID == 0)
#define RTE_I2S0_RX_PORT              P0_14
#define RTE_I2S0_RX_INPUT             USIC0_C0_DX0_P0_14
#elif  (RTE_I2S0_RX_ID == 1)
#define RTE_I2S0_RX_PORT              P0_15
#define RTE_I2S0_RX_INPUT             USIC0_C0_DX0_P0_15
#elif  (RTE_I2S0_RX_ID == 2)
#define RTE_I2S0_RX_PORT              P1_0
#define RTE_I2S0_RX_INPUT             USIC0_C0_DX0_P1_0
#elif  (RTE_I2S0_RX_ID == 3)
#define RTE_I2S0_RX_PORT              P1_1
#define RTE_I2S0_RX_INPUT             USIC0_C0_DX0_P1_1
#elif  (RTE_I2S0_RX_ID == 4)
#define RTE_I2S0_RX_PORT              P2_0
#define RTE_I2S0_RX_INPUT             USIC0_C0_DX0_P2_0
#elif  (RTE_I2S0_RX_ID == 5)
#define RTE_I2S0_RX_PORT              P2_1
#define RTE_I2S0_RX_INPUT             USIC0_C0_DX0_P2_1
#else 
#error "Invalid I2S0_RX Pin Configuration!"
#endif

//   <o> I2S0_CLK OUTPUT Pin <0=>P0_7 <1=>P0_8 <2=>P0_14 <4=>P2_0
//   <i> Transmit clock for I2S0
#define RTE_I2S0_CLK_OUTPUT_ID                0

#if    (RTE_I2S0_CLK_OUTPUT_ID == 0)
#define RTE_I2S0_CLK_OUTPUT_PORT              P0_7
#define RTE_I2S0_CLK_AF                       P0_7_AF_U0C0_SCLKOUT
#elif  (RTE_I2S0_CLK_OUTPUT_ID == 1)
#define RTE_I2S0_CLK_OUTPUT_PORT              P0_8
#define RTE_I2S0_CLK_AF                       P0_8_AF_U0C0_SCLKOUT
#elif  (RTE_I2S0_CLK_OUTPUT_ID == 2)
#define RTE_I2S0_CLK_OUTPUT_PORT              P0_14
#define RTE_I2S0_CLK_AF                       P0_14_AF_U0C0_SCLKOUT
#elif  (RTE_I2S0_CLK_OUTPUT_ID == 4)
#define RTE_I2S0_CLK_OUTPUT_PORT              P2_0
#define RTE_I2S0_CLK_AF                       P2_0_AF_U0C0_SCLKOUT
#else 
#error "Invalid I2S0_CLK Output Pin Configuration!"
#endif

//   <o> I2S0_CLK INPUT Pin <0=>P0_7 <1=>P0_8 <2=>P0_14 <3=>P1_1 <4=>P2_0
//   <i> Receive clock for I2S0
#define RTE_I2S0_CLK_INPUT_ID                0

#if    (RTE_I2S0_CLK_INPUT_ID == 0)
#define RTE_I2S0_CLK_INPUT_PORT              P0_7
#define RTE_I2S0_CLK_INPUT                   USIC0_C0_DX1_P0_7
#elif  (RTE_I2S0_CLK_INPUT_ID == 1)
#define RTE_I2S0_CLK_INPUT_PORT              P0_8
#define RTE_I2S0_CLK_INPUT                   USIC0_C0_DX1_P0_8
#elif  (RTE_I2S0_CLK_INPUT_ID == 2)
#define RTE_I2S0_CLK_INPUT_PORT              P0_14
#define RTE_I2S0_CLK_INPUT                   USIC0_C0_DX1_P0_14
#elif  (RTE_I2S0_CLK_INPUT_ID == 3)
#define RTE_I2S0_CLK_INPUT_PORT              P1_1
#define RTE_I2S0_CLK_INPUT                   USIC0_C0_DX1_P1_1
#elif  (RTE_I2S0_CLK_INPUT_ID == 4)
#define RTE_I2S0_CLK_INPUT_PORT              P2_0
#define RTE_I2S0_CLK_INPUT                   USIC0_C0_DX1_P2_0
#else 
#error "Invalid I2S0_CLK Input Pin Configuration!"
#endif

//   <o> I2S0_WS OUTPUT Pin <0=>P0_0 <1=>P0_9
//   <i> Transmit word select for I2S0
#define RTE_I2S0_WS_OUTPUT_ID                0

#if     (RTE_I2S0_WS_OUTPUT_ID == 0)
#define RTE_I2S0_WS_OUTPUT_PORT              P0_0
#define RTE_I2S0_WS_AF                       P0_0_AF_U0C0_SELO0
#elif   (RTE_I2S0_WS_OUTPUT_ID == 1)
#define RTE_I2S0_WS_OUTPUT_PORT              P0_9
#define RTE_I2S0_WS_AF                       P0_9_AF_U0C0_SELO0
#else 
#error "Invalid I2S0_WS Output Pin Configuration!"
#endif

//   <o> I2S0_WS INPUT Pin <0=>P0_0 <1=>P0_9 <4=>P0_12 <5=>P0_13
//   <i> Receive word select for I2S0
#define RTE_I2S0_WS_INPUT_ID                 0

#if    (RTE_I2S0_WS_INPUT_ID == 0)
#define RTE_I2S0_WS_INPUT_PORT               P0_0
#define RTE_I2S0_WS_INPUT_ID_INPUT           USIC0_C0_DX2_P0_0
#elif  (RTE_I2S0_WS_INPUT_ID == 1)
#define RTE_I2S0_WS_INPUT_PORT               P0_9
#define RTE_I2S0_WS_INPUT_ID_INPUT           USIC0_C0_DX2_P0_9
#elif  (RTE_I2S0_WS_INPUT_ID == 4)
#define RTE_I2S0_WS_INPUT_PORT               P0_12
#define RTE_I2S0_WS_INPUT_ID_INPUT           USIC0_C0_DX2_P0_12
#elif  (RTE_I2S0_WS_INPUT_ID == 5)
#define RTE_I2S0_WS_INPUT_PORT               P0_13
#define RTE_I2S0_WS_INPUT_ID_INPUT           USIC0_C0_DX2_P0_13
#else
#error "Invalid I2S0_WS Input Pin Configuration!"
#endif

#define RTE_I2S0_MCLK_OUTPUT_ENABLE          0

//   <o> I2S0_RX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
//   <i> Receive FIFO size for I2S0 
#define RTE_I2S0_RX_FIFO_SIZE_ID                4

#if    (RTE_I2S0_RX_FIFO_SIZE_ID == 0)
#define RTE_I2S0_RX_FIFO_SIZE         NO_FIFO
#define RTE_I2S0_RX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S0_RX_FIFO_SIZE_ID == 1)
#define RTE_I2S0_RX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S0_RX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S0_RX_FIFO_SIZE_ID == 2)
#define RTE_I2S0_RX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S0_RX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S0_RX_FIFO_SIZE_ID == 3)
#define RTE_I2S0_RX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S0_RX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S0_RX_FIFO_SIZE_ID == 4)
#define RTE_I2S0_RX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S0_RX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S0_RX_FIFO_SIZE_ID == 5)
#define RTE_I2S0_RX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S0_RX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S0_RX FIFO SIZE Configuration!"
#endif

