Infineon/amazon-freertos/vendors/infineon/XMCLib/2.2.0/CMSIS/Driver/Source/Config/XMC1100_Q24/RTE_Device.h
//   <o> I2S0_TX FIFO ENTRIES <0=>0 <1=>2 <2=>4 <3=>8 <4=>16 <5=>32
//   <i> Transmit FIFO size for I2S0 
#define RTE_I2S0_TX_FIFO_SIZE_ID                4

#if    (RTE_I2S0_TX_FIFO_SIZE_ID == 0)
#define RTE_I2S0_TX_FIFO_SIZE         NO_FIFO
#define RTE_I2S0_TX_FIFO_SIZE_NUM     0
#elif  (RTE_I2S0_TX_FIFO_SIZE_ID == 1)
#define RTE_I2S0_TX_FIFO_SIZE         FIFO_SIZE_2
#define RTE_I2S0_TX_FIFO_SIZE_NUM     2
#elif  (RTE_I2S0_TX_FIFO_SIZE_ID == 2)
#define RTE_I2S0_TX_FIFO_SIZE         FIFO_SIZE_4
#define RTE_I2S0_TX_FIFO_SIZE_NUM     4
#elif  (RTE_I2S0_TX_FIFO_SIZE_ID == 3)
#define RTE_I2S0_TX_FIFO_SIZE         FIFO_SIZE_8
#define RTE_I2S0_TX_FIFO_SIZE_NUM     8
#elif  (RTE_I2S0_TX_FIFO_SIZE_ID == 4)
#define RTE_I2S0_TX_FIFO_SIZE         FIFO_SIZE_16
#define RTE_I2S0_TX_FIFO_SIZE_NUM     16
#elif  (RTE_I2S0_TX_FIFO_SIZE_ID == 5)
#define RTE_I2S0_TX_FIFO_SIZE         FIFO_SIZE_32
#define RTE_I2S0_TX_FIFO_SIZE_NUM     32
#else
#error "Invalid I2S0_TX FIFO SIZE Configuration!"
#endif

// <o>IRQ Priority <0-3>
// <i> Defines priority of I2S events IRQ handling
// <i> Default: 3
#define RTE_I2S0_IRQ_PRIORITY  3

//</e>

// <e> I2S1 (Inter-Integrated Sound) [Driver_SAI1]
// <i> Configuration settings for Driver_SAI1 in component ::Drivers:SAI
#define RTE_I2S1                      0

//   <o> I2S1_TX Pin <0=>P0_6 <1=>P0_7 <2=>P1_2 <3=>P1_3 <5=>P2_10 <6=>P2_11
//   <i> Transmit data for I2S1
#define RTE_I2S1_TX_ID                0

#if    (RTE_I2S1_TX_ID == 0)
#define RTE_I2S1_TX_PORT              P0_6
#define RTE_I2S1_TX_AF                P0_6_AF_U0C1_DOUT0
#elif  (RTE_I2S1_TX_ID == 1)
#define RTE_I2S1_TX_PORT              P0_7
#define RTE_I2S1_TX_AF                P0_7_AF_U0C1_DOUT0
#elif  (RTE_I2S1_TX_ID == 2)
#define RTE_I2S1_TX_PORT              P1_2
#define RTE_I2S1_TX_AF                P1_2_AF_U0C1_DOUT0
#elif  (RTE_I2S1_TX_ID == 3)
#define RTE_I2S1_TX_PORT              P1_3
#define RTE_I2S1_TX_AF                P1_3_AF_U0C1_DOUT0
#elif  (RTE_I2S1_TX_ID == 5)
#define RTE_I2S1_TX_PORT              P2_10
#define RTE_I2S1_TX_AF                P2_10_AF_U0C1_DOUT0
#elif  (RTE_I2S1_TX_ID == 6)
#define RTE_I2S1_TX_PORT              P2_11
#define RTE_I2S1_TX_AF                P2_11_AF_U0C1_DOUT0
#else
#error "Invalid I2S1_TX Pin Configuration!"
#endif

//   <o> I2S1_RX Pin <0=>P0_6 <1=>P0_7 <2=>P1_2 <3=>P1_3 <4=>P2_10 <5=>P2_11
//   <i> Receive data for I2S1
#define RTE_I2S1_RX_ID                0

#if    (RTE_I2S1_RX_ID == 0)
#define RTE_I2S1_RX_PORT              P0_6
#define RTE_I2S1_RX_INPUT             USIC0_C1_DX0_P0_6
#elif  (RTE_I2S1_RX_ID == 1)
#define RTE_I2S1_RX_PORT              P0_7
#define RTE_I2S1_RX_INPUT             USIC0_C1_DX0_P0_7
#elif  (RTE_I2S1_RX_ID == 2)
#define RTE_I2S1_RX_PORT              P1_2
#define RTE_I2S1_RX_INPUT             USIC0_C1_DX0_P1_2
#elif  (RTE_I2S1_RX_ID == 3)
#define RTE_I2S1_RX_PORT              P1_3
#define RTE_I2S1_RX_INPUT             USIC0_C1_DX0_P1_3
#elif  (RTE_I2S1_RX_ID == 4)
#define RTE_I2S1_RX_PORT              P2_10
#define RTE_I2S1_RX_INPUT             USIC0_C1_DX0_P2_10
#elif  (RTE_I2S1_RX_ID == 5)
#define RTE_I2S1_RX_PORT              P2_11
#define RTE_I2S1_RX_INPUT             USIC0_C1_DX0_P2_11
#else
#error "Invalid I2S1_RX Pin Configuration!"
#endif

//   <o> I2S1_CLK OUTPUT Pin <0=>P0_8 <1=>P1_3 <3=>P2_1 <4=>P2_11
//   <i> Transmit clock for I2S1
#define RTE_I2S1_CLK_OUTPUT_ID                0

#if    (RTE_I2S1_CLK_OUTPUT_ID == 0)
#define RTE_I2S1_CLK_OUTPUT_PORT              P0_8
#define RTE_I2S1_CLK_AF                       P0_8_AF_U0C1_SCLKOUT
#elif  (RTE_I2S1_CLK_OUTPUT_ID == 1)
#define RTE_I2S1_CLK_OUTPUT_PORT              P1_3
#define RTE_I2S1_CLK_AF                       P1_3_AF_U0C1_SCLKOUT
#elif  (RTE_I2S1_CLK_OUTPUT_ID == 3)
#define RTE_I2S1_CLK_OUTPUT_PORT              P2_1
#define RTE_I2S1_CLK_AF                       P2_1_AF_U0C1_SCLKOUT
#elif  (RTE_I2S1_CLK_OUTPUT_ID == 4)
#define RTE_I2S1_CLK_OUTPUT_PORT              P2_11
#define RTE_I2S1_CLK_AF                       P2_11_AF_U0C1_SCLKOUT
#else
#error "Invalid I2S1 CLOCK OUTPUT Pin Configuration!"
#endif

//   <o> I2S1_CLK INPUT Pin <0=>P0_7 <1=>P0_8 <2=>P1_3 <3=>P2_11
//   <i> Receive clock for I2S1
#define RTE_I2S1_CLK_INPUT_ID                0

#if    (RTE_I2S1_CLK_INPUT_ID == 0)
#define RTE_I2S1_CLK_INPUT_PORT              P0_7
#define RTE_I2S1_CLK_INPUT                   USIC0_C1_DX1_P0_7
#elif  (RTE_I2S1_CLK_INPUT_ID == 1)
#define RTE_I2S1_CLK_INPUT_PORT              P0_8
#define RTE_I2S1_CLK_INPUT                   USIC0_C1_DX1_P0_8
#elif  (RTE_I2S1_CLK_INPUT_ID == 2)
#define RTE_I2S1_CLK_INPUT_PORT              P1_3
#define RTE_I2S1_CLK_INPUT                   USIC0_C1_DX1_P1_3
#elif  (RTE_I2S1_CLK_INPUT_ID == 3)
#define RTE_I2S1_CLK_INPUT_PORT              P2_11
#define RTE_I2S1_CLK_INPUT                   USIC0_C1_DX1_P2_11
#else
#error "Invalid I2S1 CLOCK INPUT Pin Configuration!"
#endif

//   <o> I2S1_WS OUTPUT Pin <0=>P0_0 <1=>P0_9 <2=>P1_1
//   <i> Transmit word select for I2S1
#define RTE_I2S1_WS_OUTPUT_ID                0

#if     (RTE_I2S1_WS_OUTPUT_ID == 0)
#define RTE_I2S1_WS_OUTPUT_PORT              P0_0
#define RTE_I2S1_WS_AF                       P0_0_AF_U0C1_SELO0
#elif   (RTE_I2S1_WS_OUTPUT_ID == 1)
#define RTE_I2S1_WS_OUTPUT_PORT              P0_9
#define RTE_I2S1_WS_AF                       P0_9_AF_U0C1_SELO0
#elif   (RTE_I2S1_WS_OUTPUT_ID == 2)
#define RTE_I2S1_WS_OUTPUT_PORT              P1_1
#define RTE_I2S1_WS_AF                       P1_1_AF_U0C1_SELO0
#else
#error "Invalid I2S1_WS Output Pin Configuration!"
#endif

//   <o> I2S1_WS INPUT Pin <0=>P0_0 <1=>P0_9 <4=>P1_1 <5=>P2_0
//   <i> Receive word select for I2S1
#define RTE_I2S1_WS_INPUT_ID                 0

#if    (RTE_I2S1_WS_INPUT_ID == 0)
#define RTE_I2S1_WS_INPUT_PORT               P0_0
#define RTE_I2S1_WS_INPUT_ID_INPUT           USIC0_C1_DX2_P0_0
#elif  (RTE_I2S1_WS_INPUT_ID == 1)
#define RTE_I2S1_WS_INPUT_PORT               P0_9
#define RTE_I2S1_WS_INPUT_ID_INPUT           USIC0_C1_DX2_P0_9
#elif  (RTE_I2S1_WS_INPUT_ID == 4)
#define RTE_I2S1_WS_INPUT_PORT               P1_1
#define RTE_I2S1_WS_INPUT_ID_INPUT           USIC0_C1_DX2_P1_1
#elif  (RTE_I2S1_WS_INPUT_ID == 5)
#define RTE_I2S1_WS_INPUT_PORT               P2_0
#define RTE_I2S1_WS_INPUT_ID_INPUT           USIC0_C1_DX2_P2_0
#else
#error "Invalid I2S1_WS Input Pin Configuration!"
#endif

